toes-backend/app/controllers/concerns/jwt_authenticatable.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def authenticate_user!
    token = extract_token
    return render_unauthorized unless token

    decoded = decode_token(token)
    return render_unauthorized unless decoded&.dig("user_id")

    @current_user = User.find_by(id: decoded["user_id"])

SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = 1 LIMIT 1
---
  def authenticate_admin!
    token = extract_token
    return render_unauthorized unless token

    decoded = decode_token(token)
    return render_unauthorized unless decoded&.dig("admin_id")

    @current_admin = AdminUser.find_by(id: decoded["admin_id"])