toes-backend/app/controllers/api/v1/admin/auth_controller.rb

        def login
          admin = AdminUser.find_by(username: params[:username])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."username" = 'admin' LIMIT 1