toes-backend/app/controllers/api/v1/admin/elections_controller.rb

INSERT INTO "elections" ("title", "description", "status", "starts_at", "ends_at", "created_at", "updated_at") VALUES ('President 2026', 'Vote!', 0, NULL, NULL, '2026-03-28 10:14:45.304113', '2026-03-28 10:14:45.304113') RETURNING "id"
---
        def create
          e = Election.new(election_params)
          if e.save

UPDATE "elections" SET "status" = 1, "updated_at" = '2026-03-28 18:19:08.166322' WHERE "elections"."id" = 6
---
        def update
          if election.update(election_params)

SELECT "candidates".* FROM "candidates" WHERE "candidates"."election_id" = 6
SELECT COUNT(*) AS "count_all", "votes"."candidate_id" AS "votes_candidate_id" FROM "votes" WHERE "votes"."election_id" = 6 GROUP BY "votes"."candidate_id"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "votes" WHERE "votes"."election_id" = 6
---
        def analytics
          e = election
          votes = e.votes.includes(:candidate)
          tally = votes.group(:candidate_id).count

          candidates = e.candidates.map do |c|
            { id: c.id, name: c.name, position: c.position, votes: tally[c.id] || 0 }
          end

          render json: {
            election_id: e.id,
            total_voters: User.count,
            votes_cast: votes.count,
            turnout_percent: User.count.zero? ? 0 : (votes.count.to_f / User.count * 100).round(2),
            candidates: candidates

SELECT "elections".* FROM "elections" WHERE "elections"."id" = 6 LIMIT 1
---
        def election
          @election ||= Election.find(params[:id])