toes-backend/app/controllers/api/v1/admin/registration_keys_controller.rb

INSERT INTO "registration_keys" ("token", "used", "election_id", "candidate_id", "created_at", "updated_at") VALUES ('49825a9212a9195951f8b6aeb33f4df0', FALSE, 5, NULL, '2026-03-28 10:14:45.420223', '2026-03-28 10:14:45.420223') RETURNING "id"
---
        def generate
          count = (params[:count] || 1).to_i.clamp(1, 100)
          keys = count.times.map { election.registration_keys.create! }

SELECT "elections".* FROM "elections" WHERE "elections"."id" = 5 LIMIT 1
---
        def election
          @election ||= Election.find(params[:election_id])