toes-backend/app/controllers/api/v1/auth_controller.rb

      def register
        voter_key = VoterKey.find_by(token: params[:voter_key])
        return render json: { error: "A valid voter key is required to register" }, status: :unprocessable_entity unless voter_key
        return render json: { error: "Voter key already used" }, status: :unprocessable_entity if voter_key.used?

        user = User.new(student_params.merge(verified: true))
        if user.save
---
INSERT INTO "users" ("student_id", "name", "email", "password_digest", "has_voted", "created_at", "updated_at") VALUES ('STU1774721946', 'Bob Jones', NULL, '$2a$12$MQKee4x5aTakNsmrxu8R1O5IgrtC2v35hl6.4UVoj08u/9e.CVSFa', FALSE, '2026-03-28 18:19:08.031435', '2026-03-28 18:19:08.031435') RETURNING "id"