toes-backend/app/controllers/api/v1/candidates_controller.rb

SELECT "elections".* FROM "elections" WHERE "elections"."id" = 5 LIMIT 1
---
      def index
        election = Election.find(params[:election_id])
        candidates = election.candidates.includes(photo_attachment: :blob)

SELECT "registration_keys".* FROM "registration_keys" WHERE "registration_keys"."token" = '49825a9212a9195951f8b6aeb33f4df0' LIMIT 1
INSERT INTO "candidates" ("name", "position", "bio", "manifesto", "election_id", "registration_key_id", "created_at", "updated_at") VALUES ('Alice Smith', 'President', 'I will lead us forward.', NULL, 5, 4, '2026-03-28 10:14:45.577156', '2026-03-28 10:14:45.577156') RETURNING "id"
---
      def register
        key = RegistrationKey.find_by(token: params[:token])

        return render json: { error: "Invalid registration key" }, status: :unauthorized unless key
        return render json: { error: "Registration key already used" }, status: :unprocessable_entity if key.used?

        election = key.election
        return render json: { error: "Election is not accepting registrations" }, status: :forbidden if election.open? || election.closed?

        candidate = election.candidates.build(candidate_params)
        candidate.registration_key = key

        ActiveRecord::Base.transaction do
          candidate.save!