toes-backend/app/controllers/api/v1/elections_controller.rb

      def show
        election = Election.where.not(status: :draft).find(params[:id])
        data = election.as_json

        # Include results only if election is closed
        if election.closed?
          tally = election.votes.group(:candidate_id).count
          data[:results] = election.candidates.includes(:questions).map do |c|
---
SELECT "elections".* FROM "elections" WHERE "elections"."status" != 0 AND "elections"."id" = 6 LIMIT 1
SELECT COUNT(*) AS "count_all", "votes"."candidate_id" AS "votes_candidate_id" FROM "votes" WHERE "votes"."election_id" = 6 GROUP BY "votes"."candidate_id"
SELECT "candidates".* FROM "candidates" WHERE "candidates"."election_id" = 6