toes-backend/app/controllers/api/v1/votes_controller.rb

SELECT "elections".* FROM "elections" WHERE "elections"."id" = 6 LIMIT 1
SELECT "candidates".* FROM "candidates" WHERE "candidates"."election_id" = 6 AND "candidates"."id" = 3 LIMIT 1
INSERT INTO "votes" ("voter_id", "candidate_id", "election_id", "created_at", "updated_at") VALUES (2, 3, 6, '2026-03-28 18:19:08.297642', '2026-03-28 18:19:08.297642') RETURNING "id"
UPDATE "users" SET "has_voted" = TRUE, "updated_at" = '2026-03-28 18:19:08.308360' WHERE "users"."id" = 2
SELECT COUNT(*) FROM "votes" WHERE "votes"."election_id" = 6
---
      def create
        election = Election.find(params[:election_id])

        return render json: { error: "Election is not open" }, status: :forbidden unless election.open?
        return render json: { error: "Your account is not verified as an eligible voter. Please use the voter key provided by an administrator when registering." }, status: :forbidden unless @current_user.verified?
        return render json: { error: "You have already voted in this election" }, status: :unprocessable_entity if @current_user.has_voted?

        candidate = election.candidates.find(params[:candidate_id])

        vote = nil
        ActiveRecord::Base.transaction do
          vote = Vote.create!(voter: @current_user, candidate: candidate, election: election)
          @current_user.update!(has_voted: true)

          # Broadcast live analytics update
          ActionCable.server.broadcast(
            "analytics_#{election.id}",
            { votes_cast: election.votes.count }
          )